{
    "id": 436969,
    "page": 1,
    "results": [
        {
            "author": "Peter89Spencer",
            "author_details": {
                "name": "",
                "username": "Peter89Spencer",
                "avatar_path": "/https://secure.gravatar.com/avatar/dadb1b759a8516c815cdcc58abcefc85.jpg",
                "rating": 8
            },
            "content": "The Suicide Squad...\r\n...stayed true to the hype of the anti-hero teams in DC.\r\n\r\nI feel like it wasn't really a sequel but rather a reboot and ignoring the first film.\r\nThe action was insane and BLOODY brilliant, with a stellar cast. And they LITERALLY killed off the first team at the very start of the film! To be honest, I wasn't really surprised as I didn't see more of them in later scenes of the trailer. But I was surprised they killed off Captain Boomerang - he was basically the primary member of the team! And I especially wanted to see more character build up with Savant, learn more of his backstory. Instead, he just turned out to be a totally wuss that's only good at killing small birds! But what shocked me the most was Rick Flagg's death!\r\n\r\nStill, Idris Elba and John Cena were fucking awesome as Bloodsport and Peacemaker, respectively. And King Shark was hilariously awesome. Funnier that Groot because at least he says more than three words - although, \"hand\" would have to be my favourite moment!\r\n\r\nI did had mixed feelings from the start, but then I started to really get into it all!",
            "created_at": "2021-07-30T23:37:33.102Z",
            "id": "61048d3d688cd0007f215a28",
            "updated_at": "2021-07-30T23:37:33.102Z",
            "url": "https://www.themoviedb.org/review/61048d3d688cd0007f215a28"
        },
        {
            "author": "JPV852",
            "author_details": {
                "name": "",
                "username": "JPV852",
                "avatar_path": "/xNLOqXXVJf9m7WngUMLIMFsjKgh.jpg",
                "rating": 7
            },
            "content": "For sure has its moments and also has James Gunn's fingerprints with the dark humor. Not sure I would rank this all that high amongst all comic book movies, nor is it near the top compared with some DC, but it's a step up from the previous entry. The performances all around were well done with Idris Elba and John Cena being the highlights but everyone else were great. **3.75/5**",
            "created_at": "2021-08-06T14:21:35.658Z",
            "id": "610d456f5bce9e002cfa1ef5",
            "updated_at": "2021-08-06T14:21:35.658Z",
            "url": "https://www.themoviedb.org/review/610d456f5bce9e002cfa1ef5"
        },
        {
            "author": "JW2804",
            "author_details": {
                "name": "",
                "username": "JW2804",
                "avatar_path": null,
                "rating": null
            },
            "content": "I was pleasantly surprised by this one, I had not watched any trailers in the run up to watching it but I was expecting it to be a bit lame but it turned out to be a good movie. I was surprised when pretty much the whole first team was killed off straight of the bat especially since some of the characters where played by well known actors, it wasn't all about Harlequin, John Cena and Idris Elba worked well together, good movie worth going to the cinema to watch it.",
            "created_at": "2021-08-13T22:06:22.841Z",
            "id": "6116ecdecee481002e284eea",
            "updated_at": "2021-08-13T22:15:22.619Z",
            "url": "https://www.themoviedb.org/review/6116ecdecee481002e284eea"
        },
        {
            "author": "RADIO1'S MR. MOVIE!-MAD AMI 🌠",
            "author_details": {
                "name": "RADIO1'S MR. MOVIE!-MAD AMI 🌠",
                "username": "Radio1'sMr.Movie!-MadAmi🌠",
                "avatar_path": "/zFnEnSYKUXIRBjLWLqV4CQcnxx7.jpg",
                "rating": 9
            },
            "content": "**From Director JAMES GUNN : \"The Supremely Delectable Art Of, Er, HOMICIDE, 101🤦‍♂️💥😅\"**\r\n\r\n______________________________________________________\r\nA  **-{ _B I G_ }-**  Screen **Micro** Review . Film Viewed By Me At **_NOVO CINEMAS_** Sharjah UAE, On August 16\r\n______________________________________________________ \r\n\r\nSo usually, I try and maintain a somewhat orderly structure with my Reviews, namely : 'Intro->-Body->-Summation'. This time, just to 'Keep-it fresh', I just thought I'd shake things up a bit, and { quite literally } write my review, er . . . .  'backwards'. Hence, without further ado, here goes 😉❗ \r\n\r\nFINAL ANALYSIS : \r\nAs a 'doting' parent, I'm going to come clean and tell you that I had a real problem with the fact that I -{ Did }- really enjoy this -Certifiably- { Decadent } \"Bloodsoaked Adult Goof-fest\", and in no small measure either, at that. Sure it was 'dominated' mostly by -Cartoonish- violence meant only for 'Mature' viewers, ( it has an M.p.a.a certified rating of 'R' ) ; however ...the, um, how shall I say... \"Sheerly, Obscenely, Gratuitous\" levels of gore in said movie -Did- somewhat take me by surprise . . . given as it comes -directly- from the Director -best- know for his ( -relatively- ) \"More kosher\" -M.c.u- ( 'Marvel Cinematic Universe' ) . . . blockbuster fare. \r\n\r\nHIGH POINTS : \r\n1. \"Peacemaker\" : The cheeky,  sneaky', yet unequivocally -{ \"Bold, Fresh & Fabulous\" }- takedown of the long, long, long standing -Imperialist- tendencies ; but more significantly, the -{ \"Hypocricies & Triple-standards\" }- of, \"Past United States Governments\", -Symbolically- , of course.\r\n2. Simply Put : basically -\"Everything\"- the { Stunningly 💣 💥❗ } Talented Margot Robbie, ( 'Harley Quinn' ) does ; with an 'Extra-special' mention for her -protracted- \"Escape From Coronel\" fight scene. 3. Daniela Melchoir, ( 'Ratcatcher-two' ) : This peculiarly endowed 'Anti-heroine' has a seiously -Bizarre- talent... but she, along with Idris Elba's 'Bloodsport', the just bespoke Margot's 'Harley' ( -and Others- ) ...end up bringing a veritable -{ \" Ton Of -Unexpected & Genuine- Heart \" }- to 'The Suicide Squad'. \r\n\r\n**\" A Conflicted, yet -Thoroughly- Entertained, 8.50 Marks Out Of 10 From Me \" ;** if only out of 'Absolute Admiration' for the 'Funny, & Insanely-Creative' James Gunn. It bears iterating that I ( -Very Obviously- ) won't be letting my kids anywhere \"Near\" this super-Crazy, Super-Fun picture . . . -{ However }- . . . the Reviewer in me has -Indeed- won over the Parent, in this instance, all the same 🤷‍♂️ 😂 .",
            "created_at": "2021-08-17T10:59:48.656Z",
            "id": "611b96a49f0e1900440acce5",
            "updated_at": "2021-08-18T19:17:35.273Z",
            "url": "https://www.themoviedb.org/review/611b96a49f0e1900440acce5"
        },
        {
            "author": "echeng",
            "author_details": {
                "name": "",
                "username": "echeng",
                "avatar_path": "/https://secure.gravatar.com/avatar/a45a699a3053cfdbcb97494eb2a6469c.jpg",
                "rating": 8
            },
            "content": "This is one fun and violent superhero movie that is just entertaining. A nice break from the vast universe of Marvel, this is just a simple fun movie.\r\n\r\nCrazy, silly, surprising and hilarious.\r\n\r\nDefinitely recommended!",
            "created_at": "2021-08-29T12:55:16.583Z",
            "id": "612b83b4a1d33200473fc3c6",
            "updated_at": "2021-09-09T17:17:52.933Z",
            "url": "https://www.themoviedb.org/review/612b83b4a1d33200473fc3c6"
        },
        {
            "author": "SpotaMovie.com",
            "author_details": {
                "name": "SpotaMovie.com",
                "username": "bastag",
                "avatar_path": "/h9FkucYmSN3YH5OmrNRWO5rdquS.jpg",
                "rating": 9
            },
            "content": "Full Review and Analysis at Spotamovie.com \r\n\r\n**The Suicide Squad – Introduction**\r\nTake the weirdest villains, give them an impossible mission, add some creepy humour, actions, colours and talent, and you get “The Suicide Squad.”\r\nIf some villains in 2021 try to improve and become better people, see Cruella, for instance, we can’t say the same for our protagonists on the scene. They are looking to please the American government to gain some favour in return. However, some of them will surprise us with some good intentions and actions.It’s an exciting movie, spectacular in its genre and filled with dark humour and great character. So let’s dive into the story and some insights.\r\n\r\n**The Suicide Squad – The Story**\r\nThe American government organises a secret mission to take control of “Project Starfish” in the South American island of Corto Maltese. However, a recent coup overthrew the friendly American government and, the task forces created by intelligence officer Amanda Waller needs to destroy the laboratory of the secret experiment, Jötunheim. Colonel Rick Flag leads the first team that tries to enter the Corto Maltese’s beach. At the same time, the second team leader is Bloodsport, an assassin who accepted the mission under the blackmail of the American authorities. Both teams will have to strive and survive to accomplish the critical goal.\r\n\r\nOur heroes, or villains, needs to save the world from “Starro The Conqueror”, a dangerous weapon in the hands of the not trustable Corto Maltese’s government. But also prevent a tremendous international scandal that will destroy America’s reputation in the world.\r\n\r\nWill our team succeed with their mission?\r\nWhat will be the price to pay?\r\nAnd what is the difference between a not trustable regime and one which conspires against the world for its interests? \r\n\r\nFull Review and Analysis at https://www.spotamovie.com/the-suicide-squad-2021-movie-review-and-analysis/",
            "created_at": "2021-09-05T10:09:34.228Z",
            "id": "6134975e64f71600629ffb82",
            "updated_at": "2021-09-05T10:09:34.228Z",
            "url": "https://www.themoviedb.org/review/6134975e64f71600629ffb82"
        },
        {
            "author": "msbreviews",
            "author_details": {
                "name": "",
                "username": "msbreviews",
                "avatar_path": "/https://secure.gravatar.com/avatar/992eef352126a53d7e141bf9e8707576.jpg",
                "rating": 8
            },
            "content": "FULL SPOILER-FREE REVIEW @ https://www.msbreviews.com/movie-reviews/the-suicide-squad-spoiler-free-review\r\n\r\n\"The Suicide Squad is everything its predecessor should have been, boasting everything a Suicide Squad film deserves. Proper rated-R content with extremely gory, bloody action sequences, which are impressively shot and choreographed through long takes, exceptional stunt work, and surprisingly outstanding VFX. \r\n\r\nWith the help of a witty soundtrack, James Gunn brings his dark humor to an expectedly hilarious level, though not all jokes land in a still generic screenplay filled with the usual cliches and formulaic developments. Nevertheless, the phenomenal cast elevates the overall picture with fantastic performances all-around, though Daniela Melchior's breakthrough performance is an absolute standout. \r\n\r\nEach squad member receives decent screentime to share their emotionally compelling backstories, transforming a superhero movie into a character-driven story instead of just a team of superpowered nobodies beating up a random CGI monster. \r\n\r\nGunn just can't seem to miss.\"\r\n\r\nRating: B+",
            "created_at": "2021-09-07T18:22:29.451Z",
            "id": "6137ade5a217c000890ea0b8",
            "updated_at": "2021-09-07T18:22:29.451Z",
            "url": "https://www.themoviedb.org/review/6137ade5a217c000890ea0b8"
        }
    ],
    "total_pages": 1,
    "total_results": 7
}
